{
  "Скачать": "Download",
  "Светлая Тема": "Light theme",
  "Темная Тема": "Dark theme",
  "English": "Русский",

  "контакты": "contacts",
  "Предпочтительный способ связи -": "Preferred way of contact -",
  "языки": "languages",
  "Английский": "English",
  "B1 - средний": "B1 - medium",
  "Русский": "Russian",
  "Родной": "Native",

  "мягкие навыки": "soft skills",
  "Внимательность": "Attentiveness",
  "Ответственность": "Responsibility",
  "Пунктуалность": "Punctuality",
  "Хороший уровень коммуникации": "Good communication skills",
  "Умение работать в команде": "The skill of effective teamwork",
  "Нацеленность на саморазвитие в выбранной сфере, в т.ч. постоянное обучение": "Commitment to self-development in the chosen field, including continuous learning",

  "навыки": "skills",
  "адаптивная верстка": "adaptive layout",
  "библиотеки": "libs",
  "Методология FSD": "FSD Methodology",
  "Имеется опыт разработки с использованием Angular(2+) и RxJS": "Experience in development with Angular(2+) and RxJS",

  "Кузнецов Сергей": "Kuznetsov Sergey",
  "Frontend-разработчик": "Frontend-developer",
  "Республика Беларусь, г.Гомель": "Republic of Belarus, Gomel",

  "опыт работы": "work experience",
  "Содержание работы": "Job Description",
  "Разработка и поддержка UI-приложения (добавление новых фич, актуализация зависимостей)": "Development and maintenance of a UI application (adding new features, updating dependencies)",
  "Устранение выявленных деффектов": "Fixing bugs",
  "Рефакторинг кода, устранение codeSmells и прочих замечаний, выявленных sonarqube": "Refactoring code, fixing code smells and other issues identified by SonarQube",
  "Разработка Unit и e2e тестов фронтенд части": "Development of unit and e2e tests for the frontend",
  "Разрабатываемое приложение относится к сфере финтеха (для АО 'АльфаБанк'). Построено на основе микросервисной архитектуры;": "The developed application pertains to the fintech sector (for JSC 'AlfaBank'). It is built based on a microservices architecture;",
  "Основная используемая технология — Реакт, также используется NodeJS;": "The main technology used is React, along with NodeJS;",
  "В сфере ответственности имеются модули, написанные как на классах, так и на функциях;": "The scope of responsibility includes modules written in both class-based and functional approaches;",
  "В качестве стейт-менеджера — используется RTK, в т.ч. RTK-Query. Использование библиотек Jest и Cypress для разработки тестов. Подключение модулей приложения посредствам WMF (Webpack). Активное использование библиотеки Core-components. Устранение выявленных при помощи AppSec уязвимостей;": "RTK, including RTK Query, is used for state management. Jest and Cypress libraries are used for test development. Modules of the application are connected via WMF (Webpack). There is active use of the Core-components library. Identified vulnerabilities are fixed using AppSec;",
  "В качестве дополнительной нагрузки осуществляется подготовка учебных докладов по техническим темам для принятых на работу начинающих специалистов.": "Additionally, there is the responsibility of preparing educational presentations on technical topics for newly hired junior specialists.",
  "asist-description1": "Development of UI applications with different technologies (React, NextJs, Angular(2+))",
  "asist-description2": "An outsourcing company specializing in working with clients from Israel, Europe, and the USA. I improved my English language skills there.",
  "asist-description3": "Also, working there I had the opportunity to use a wide range of development tools (Node (Express), React, Next, Angular (with extensive using RxJS)), and to participate in the development of various front-end applications (an application for an eye surgery clinic, a CRM system with extensive functionality for an American client, an online portal for customers and service providers in the entertainment industry…).",

  "о себе": "about me",

  "н.в.": "Present",
  "Клевертек": "Clevertec",
  "frontend-разработчик": "frontend-developer",
  "Обязанности": "Responsibilities",
  "О работе": "About Work",
  "Асист-Лаб": "Asist-lab",

  "образование": "education",
  "Факультет права, Юрист": "Law Faculty, Lawyer",
  "Академия Министерства внутренних дел Республики Беларусь": "Academy of the Ministry of Internal Affairs of the Republic of Belarus",
  "Гомельский государственный университет им. Ф. Скорины": "Francisk Skorina Gomel State University",
  "Экономический факультет, Бухгалтер": "Faculty of Economics, Accountant",
  "Факультет переподготовки, Переводчик-референт": "Faculty of Retraining, Translator-Referent",

  "курсы": "courses",
  "IT-Академия": "IT-Academy",
  "Разработка веб-приложений с использованием Javascript": "Web Application Development with Javascript",
  "Разработка веб-сайтов с использованием HTML, CSS и JavaScript": "Website Development with HTML, CSS, and JavaScript",

  "Тренировочные проекты": "Pet Projects",

  "Ссылка на репозиторий": "Link to the repository",
  "Игра 'Поймай Google'": "'Catch Google' game",
  "Проект подготовлен на чистом JavaScript.": "The project is developed with vanilla JavaScript.",
  "Основная цель - разобраться на практике с теми трудностями, которые легко решаются применением различных фреймворков или библиотеки React, что полезно для более глубокого осмысления процесса разработки.": "The main goal is to deal in practice with those difficulties that can be easily solved using various frameworks or the React library. It's useful for a deeper understanding of the development process.",
  "В проекте применен осмысленный подход к построению его архитектуры. Приложение явно разбито на ядро и интерфейс. Ядро реализуют логику работы, а интерфейс отображает визуальную часть. Интерфейс взаимодействует с ядром посредствам созданного для этих целей адаптера. Реализован однонаправеленный поток данных.": "The project uses a meaningful approach to the construction of its architecture. The application is clearly divided into a core and an interface. The core implements the bussines logic, and the interface displays the visual part. The interface interacts with the core through an adapter created for this purpose. A unidirectional data flow is implemented.",
  "При разработке интерфейса использован компонентный подход. Приложение не завершенное. Впредь планируется добавление возможности игры по сети.": "A component-based approach was used in the development of the interface. The application is incomplete. From now on, it is planned to add the ability to play online.",

  "Веб сайт 'Сборник Статей'": "Website 'Digest of Articles'",
  "Проект подготовлен на React кастомной сборки (create-react-app не использовался) с использованием TypeScript. Представляет собой веб сайт для размещения статей различными авторами.": "The project was developed on React custom build (create-react-app was not used) using TypeScript. It is a website for posting articles by various authors.",
  "Для логина следует использовать никнэйм 'admin' и пароль '123'": "To log in, use the nickname 'admin' and the password '123'",
  "В качестве сборщика использован Webpack. В связи с тем, что create-react-app не использовался, сборщик настроен вручную, добавлено множество плагинов и лоудеров.": "Webpack is used as the bundler. Due to the fact that the create-react-app was not used, the bundler was configured manually, and many plugins and loaders were added.",
  "Основная цель - прокачаться не только в использовании React, но и в смежных технологиях, в т.ч. связанных с инфраструктурой веб приложений. Дизайн UI не является сильной стороной данного проекта, поскольку цель его разработки не связана с изученем дизайна.": "The main goal is to upgrade not only React skills, but also learning related technologies, including those related to the infrastructure of web applications. UI design is not a strong point of this project, since the purpose of its development is not related to the study of design.",
  "В качестве архитектурного подхода выбран FSD": "FSD was chosen as the architectural approach",
  "К настоящему моменту в проекте реализовано:": "To date, the project has implemented:",
  "Настроен сборщик, его конфиг декомпозирован. При настройке конфига использованы переменные окружения; Добавлены лоудеры и плагины, необходимые для правильной работы приложения;": "The bundler is configured, its config is decomposed. During configuring, environment variables were used; loaders and plugins which are necessary for the correct operation of the application were added;",
  "Организована работа со стилями, при которой добавление цветовых тем является простой задачей. Также добавлено несколько цветовых тем;": "Working with styles is organized. Due to its organization adding color themes is a simple task. Several color themes have also been added;",
  "Реализован роутинг с ленивой подгрузкой;": "Routing with lazy loading is implemented;",
  "Добавлена интернационализация приложения;": "The application were internationalized;",
  "Подключен и настроен Redux Toolkit с асинхронными редьюсерами;": "The Redux Toolkit with asynchronous reducers is connected and configured;",
  "Реализована авторизация и добавлен сервер для обработки запросов. Сервер разработан для платформы NodeJS;": "Authorization has been implemented and a server has been added to process requests. The server is designed for the NodeJS platform;",
  "Разработаны модули профиля, статьи;": "Profile and articles modules have been developed;",
  "Пагинация списка статей реализована через бесконечный скролл;": "Pagination of the articles list is implemented through infinity scroll;",
  "Добавлены фильтры, сортировки и поиски статей": "Added filters, sorting and article searches",
  "Разработан ESLint plugin который загружен в NPM и установлен;": "The ESLint plugin has been developed which is loaded into NPM and then installed;",
  "Проект далеко не является законченным, происходит постоянное дополнение и улучшения в процессе изучения различных инструментов разработки.": "The project is far from complete, there is a constant addition and improvement in the process of studying various development tools."
}
